<?php

use Illuminate\Database\Seeder;

class taiken_table_seeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      $faker=Faker\Factory::create('ja_JP');
      // $taiken=[
      //   [
      //     'id'=>'0',
      //     'field'=>'IT',
      //     'name'=>'Androidプログラミング体験'
      //   ],
      //   [
      //     'id'=>'1',
      //     'field'=>'IT',
      //     'name'=>'ネットワーク・セキュリティ体験'
      //   ],
      //   [
      //     'id'=>'2',
      //     'field'=>'IT',
      //     'name'=>'システムエンジニア体験'
      //   ],
      //   [
      //     'id'=>'3',
      //     'field'=>'IT',
      //     'name'=>'ネットワークエンジニア体験'
      //   ],
      //   [
      //     'id'=>'4',
      //     'field'=>'IT',
      //     'name'=>'Webプログラミング体験'
      //   ],
      //   [
      //     'id'=>'5',
      //     'field'=>'ビジネス',
      //     'name'=>'ビジネス体験'
      //   ],
      //   [
      //     'id'=>'6',
      //     'field'=>'ゲーム',
      //     'name'=>'ゲームプログラマー(モバイル)体験'
      //   ],
      //   [
      //     'id'=>'7',
      //     'field'=>'ゲーム',
      //     'name'=>'ゲームプログラマー(3Dアクション)体験'
      //   ],
      //   [
      //     'id'=>'8',
      //     'field'=>'ゲーム',
      //     'name'=>'ゲームプログラマー(オンライン)体験'
      //   ],
      //   [
      //     'id'=>'9',
      //     'field'=>'ゲーム',
      //     'name'=>'ゲームプランナー体験'
      //   ],
      //   [
      //     'id'=>'10',
      //     'field'=>'ゲーム',
      //     'name'=>'キャラクターデザイン体験'
      //   ],
      //   ['id'=>'11',
      //     'field'=>'ゲーム',
      //     'name'=>'ゲームCGデザイナー体験'
      //   ],
      //   [
      //     'id'=>'12',
      //     'field'=>'デザイン・Web・イラスト',
      //     'name'=>'デジタルイラスト体験'
      //   ],
      //   [
      //     'id'=>'13',
      //     'field'=>'デザイン・Web・イラスト',
      //     'name'=>'グラフィックデザイン体験'
      //   ],
      //   [
      //     'id'=>'14',
      //     'field'=>'デザイン・Web・イラスト',
      //     'name'=>'アナログイラスト体験'
      //   ],
      //   [
      //     'id'=>'15',
      //     'field'=>'デザイン・Web・イラスト',
      //     'name'=>'マンガイラスト体験'
      //   ],
      //   [
      //     'id'=>'16',
      //     'field'=>'デザイン・Web・イラスト',
      //     'name'=>'Webデザイン体験'
      //   ],
      //   [
      //     'id'=>'17',
      //     'field'=>'CG・映像・アニメーション系',
      //     'name'=>'3DCG体験'
      //   ],
      //   [
      //     'id'=>'18',
      //     'field'=>'CG・映像・アニメーション系',
      //     'name'=>'CG映像体験'
      //   ],
      //   [
      //     'id'=>'19',
      //     'field'=>'CG・映像・アニメーション系',
      //     'name'=>'画像合成体験'
      //   ]
      // ];
      for($i=0;$i<5;$i++){
        $ran=mt_rand()%10;
        DB::table('Taiken')->insert([
          'field'=>$ran,
          'name'=> $faker -> name()
        ]);
      }
    }
}
